Autodesk.Revit.DB.Mechanical.SpaceType.kConfinementCellsCourtHouse
Space Type is ConfinementCellsCourtHouse.

Autodesk.Revit.DB.Mechanical.SpaceType.kConfinementCellsPenitentiary
Space Type is ConfinementCellsPenitentiary.